tutorials/lagrangian/sprayFoam/aachenBomb/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// ************************************************************************* //

dimensions          [ 0 0 0 0 0 0 0 ];

internalField       uniform 0.234;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
}

// ************************************************************************* //
